Tekla Open API Reference for Tekla Structures 2025
DimensionExaggerationAttributes Properties
The DimensionSetBaseAttributes.DimensionExaggerationAttributes type exposes the following members.
Properties
Name | Description
ExaggerationDirection
 The ExaggerationDirection.
ExaggerationEnabled
 Exaggeration is enabled if the value is true.
ExaggerationHeight
 The ExaggerationHeight.
ExaggerationOrigin
 The ExaggerationOrigin.
ExaggerationPosition
 The ExaggerationPosition.
ExaggerationWidth
 The ExaggerationWidth.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
Tekla.Structures.Drawing Namespace